; domain
(define (domain strips_sat_x_1-domain)
 (:requirements :strips :typing :negative-preconditions :equality)
 (:types satellite direction instrument mode)
 (:predicates (on_board ?i - instrument ?s - satellite) (supports ?i - instrument ?m - mode) (pointing ?s - satellite ?d - direction) (power_avail ?s - satellite) (power_on ?i - instrument) (calibrated ?i - instrument) (have_image ?d - direction ?m - mode) (calibration_target ?i - instrument ?d - direction))
 (:action turn_to
  :parameters ( ?s - satellite ?d_new - direction ?d_prev - direction)
  :precondition (and (pointing ?s ?d_prev) (not (= ?d_new ?d_prev)))
  :effect (and (pointing ?s ?d_new) (not (pointing ?s ?d_prev))))
 (:action switch_on
  :parameters ( ?i - instrument ?s - satellite)
  :precondition (and (on_board ?i ?s) (power_avail ?s))
  :effect (and (power_on ?i) (not (calibrated ?i)) (not (power_avail ?s))))
 (:action switch_off
  :parameters ( ?i - instrument ?s - satellite)
  :precondition (and (on_board ?i ?s) (power_on ?i))
  :effect (and (not (power_on ?i)) (power_avail ?s)))
 (:action calibrate
  :parameters ( ?s - satellite ?i - instrument ?d - direction)
  :precondition (and (on_board ?i ?s) (calibration_target ?i ?d) (pointing ?s ?d) (power_on ?i))
  :effect (and (calibrated ?i)))
 (:action take_image
  :parameters ( ?s - satellite ?d - direction ?i - instrument ?m - mode)
  :precondition (and (calibrated ?i) (on_board ?i ?s) (supports ?i ?m) (power_on ?i) (pointing ?s ?d))
  :effect (and (have_image ?d ?m)))
)

; problem
(define (problem strips_sat_x_1-problem)
 (:domain strips_sat_x_1-domain)
 (:objects
   satellite0 - satellite
   star0 groundstation1 groundstation2 phenomenon3 phenomenon4 star5 phenomenon6 - direction
   instrument0 - instrument
   image1 spectrograph2 thermograph0 - mode
 )
 (:init (supports instrument0 thermograph0) (calibration_target instrument0 groundstation2) (on_board instrument0 satellite0) (power_avail satellite0) (pointing satellite0 phenomenon6))
 (:goal (and (have_image phenomenon4 thermograph0) (have_image star5 thermograph0) (have_image phenomenon6 thermograph0)))
)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (turn_to satellite0 groundstation2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 3
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 3
5. (take_image satellite0 phenomenon6 instrument0 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 1 of 3
6. (turn_to satellite0 star5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star5)
   goals met: 1 of 3
7. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 2 of 3
8. (turn_to satellite0 phenomenon4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 3
9. (take_image satellite0 phenomenon4 instrument0 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 3 of 3
